package com.zzwdkj.gprs;

/**
 * 和设备交互命令
 */
public enum ChargeCmd {

    WD04("设备回应程序版本"),
    WD10("设备回应程序版本"),
    WD17("设备回应程序版本"),
    WD15("设备回应程序版本"),
    WD16("设备回应程序版本"),
    WD24("设备回应程序版本"),
    WD60("设备回应程序版本"),
    WD29("设备回应程序版本"),
    WD20("设备回应程序版本"),
    WD28("设备回应支付"),
    WD11("设备回应心跳间隔"),
    WD25("设备回应重启模块"),
    WD50("设备回应投币脉冲宽度"),
    WD51("设备回应投币脉冲间隔"),
    WD61("设备回应单位投币脉冲对应继电器吸合时间"),
    WS20("服务端下发索要程序版本"),
    WS28("服务端下发支付"),
    WS29("服务端下发索要收入金额"),
    WS11("服务端下发心跳间隔"),
    WS24("服务端下发恢复默认"),
    WS25("服务端下发重启模块"),
    WS30("继电器吸合时间"),
    WS50("服务端下发投币脉冲宽度"),
    WS51("服务端下发投币脉冲间隔"),
    WS61("服务端下发单位投币脉冲对应继电器吸合时间"),
    WD302("继电器吸合时间 "),
    BS99("心跳包"),
    CY40("读取从机型号"),
    CYR40("接收从机型号返回指令"),
    CY41("修改从机的大中小功率段的时间，下限功率，预扣金额，喇叭音量大小"),
    CYR41("修改从机的大中小功率、下限功率、预扣金额、喇叭音量大小成功返回指令"),
    CY42("支付命令"),
    CYR42("支付返回指令"),
    CY43("查询刷卡总额和投币/网络收入总额"),
    CYR43("查询刷卡和投币总额返回指令"),
    CY44("读取从机的每一路的运行状态、预付费或是计次、剩余时间或剩余金额"),
    CYR44("读取从机每一路运行状态、预付费或是计次，以及剩余时间或剩余金额返回指令"),
    CY45("读取10路机的大中小功率段的时间、下限功率、预扣金额、喇叭音量大小"),
    CY46("读取10路机的大中小功率段的时间、下限功率、预扣金额、喇叭音量大小"),

    CYR45("读取功率参数返回指令"),
    BS97("连接关闭");
    private String val;

    ChargeCmd(String val) {
        this.val = val;
    }

    public String getVal() {
        return val;
    }

    public void setVal(String val) {
        this.val = val;
    }

    @Override
    public String toString() {
        return "ChargeCmd{" +
                "val='" + val + '\'' +
                '}';
    }

    public static void main(String[] args) {
        System.out.println("[00000047BS0511327]{00000047BS030027000280649}[00000047BS030027000280649][00000047BS0511327]".replaceAll("\\{", "[").replaceAll("}", "]").replaceAll("\\[", ""));
    }
}
